app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
SELECT COUNT(*) FROM "companies"
---
  def index
    @companies = Company.all

INSERT INTO "companies" ("businessName", "comercialBusiness", "created_at", "employees", "rfc", "sector", "tradeName", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @company = Company.new(company_params)
    @company.save

DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 1]]
---
  def destroy
    @company.destroy